app/controllers/contacts_controller.rb

SELECT  DISTINCT "contacts".* FROM "contacts" WHERE ("name" ILIKE '%rodrigo%' OR "name" ILIKE '%rodrigo%') ORDER BY name asc LIMIT $1 OFFSET $2  [["LIMIT", 2], ["OFFSET", 0]]
SELECT COUNT(DISTINCT "contacts"."id") FROM "contacts" WHERE ("contacts"."name" ILIKE '%Elis%')
---
  def index
    # @contacts = Contact.all
    @q = Contact.ransack(params[:q])
    @contacts = @q.result(distinct: true).order("name asc").paginate(:page => params[:page], :per_page => 20)

INSERT INTO "contacts" ("name", "company_name", "office_number", "mobile_number", "home_number", "address", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
  def create
    @contact = Contact.new(contact_params)

    respond_to do |format|
      if @contact.save